content/articles/sauces.org
#+TITLE: Sauces
#+OPTIONS: \n:t

* Sauces
** Salsa :Mexican:Sauce:
Got the recipe from this [[https://www.youtube.com/watch?v=Upqp21Dm5vg][video]].

- 2-3 large, ripe tomatoes - firm, fragrant, preferably on the vine
- 1 medium red onion
- 1 Jalapeño or a small piece of habanero
- Fresh garlic (1 clove)
- salt to taste
- Freshly ground pepper to taste
- Scallions, aka green onions (one)
- parsley (optional)
- 1 red bell pepper (optional)
- 1 mango (optional) - soft but not mushy to the touch

** Teriyaki Sauce :Sauce:Japanese:
*** 3 Ingredient Version
Basic teriyaki sauce

Ingredients: 
- 1/3 cup Japanese mirin (sweet rice wine) 
- 2 tablespoons soy sauce, low sodium preferred 
- 1 tablespoon sugar 

Instructions:
1. Combine all the ingredients of the Teriyaki Sauce in a sauce pan. On low heat, simmer and reduce it to a thicker consistency, about 10 minutes.

[[https://www.tasteandtellblog.com/teriyaki-chicken/][Another way to make teriyaki sauce]]
[[https://www.bbcgoodfood.com/recipes/teriyaki-sauce][Fridge sauce]]

*** Improved version
Basic teriyaki sauce

Ingredients: 
- 1/3 cup Japanese mirin (sweet rice wine) 
- 2 tablespoons soy sauce, low sodium preferred 
- 1 tablespoon sugar 
- 1-2 tablespoons honey
- 1 cloves garlic

Instructions:
1. Combine all the ingredients of the Teriyaki Sauce in a sauce pan. On low heat, simmer and reduce it to a thicker consistency, about 10 minutes.

[[https://www.tasteandtellblog.com/teriyaki-chicken/][Another way to make teriyaki sauce]]

*** Storing version
Ingredients: 
- 1-2 tablespoons honey
- 1 cloves garlic
- 4cm piece ginger
- mirin
- 50ml soy sauce
- 1 tbsp cornflour
- 1 tbsp rice wine vinegar
- 350ml water

[[https://www.bbcgoodfood.com/recipes/teriyaki-sauce][Fridge sauce]]
** Garlic sauce :Sauce:
For the love of god don't put any lemon in it
Jesus fucking christ that's awful
[[https://fussfreeflavours.com/easy-kebab-shop-garlic-sauce-recipe/][Link]]


| Amount | Ingredient   |
|--------+--------------|
| 2 tbsp | mayonnaise   |
| 2 tbsp | yoghurt      |
| 1      | clove garlic |
|        | bieslook     |
|        | peterselie   |
|--------+--------------|

1. With the back of a knife, crush the garlic with a pinch of salt into a paste.
2. Mix garlic, mayonnaise and yoghurt. Season to taste with salt and pepper.
** Cheese dip :Cheese:Dip:
[[https://www.youtube.com/watch?v=PTbdvND_YLQ][Sodium Citrate]]
This looks like a better way to make a dip.
** Burger Sauce :Sauce:
Ingredients:
- 2/3 Mayonnaise
- 1/3 Ketchup
- Garlic powder
- Onion powder
- Paprika (regular or smoked)
- Sweet relish (chopped pickles)
** Creamy Buffalo :Sauce:
[[https://www.ethanchlebowski.com/cooking-techniques-recipes/creamy-buffalo-sauce][Link for sauce]]
This is quite a nice sauce I've tried it with sriracha sauce as hot sauce.
The only thing I noticed is to watch out with what type of sriracha since some of them are thicker.

- 1 part hot sauce
- half part butter
- half part yogurt
- black pepper
- garlic powder
- lemon zest

- Add the butter to a pan over medium heat. When the butter has started to bubble, remove from heat to let the butter and pan cool, add the hot sauce and stir continuously to form an emulsified sauce between the two.
- Once cooled, add the plain yogurt and stir to combine. Follow that with a couple cranks of black pepper, sprinkle of garlic powder, lemon zest, and a pinch of msg. The msg will mellow out the spiciness of the sauce.
- Pour into a squeeze bottle and store in the fridge. Use as a dipping sauce, a marinade for chicken, or as a salad dressing. You've got options, baby.


[[https://www.delish.com/cooking/recipe-ideas/recipes/a51133/classic-buffalo-wings-recipe/][With wings]]
