html/articles/sauces.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-04 di 14:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sauces</title>
<meta name="author" content="Tobin Stultiens" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Sauces</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org99035a8">1. Sauces</a>
<ul>
<li><a href="#orgafe3456">1.1. Salsa&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Mexican">Mexican</span>&#xa0;<span class="Sauce">Sauce</span></span></a></li>
<li><a href="#org3269357">1.2. Teriyaki Sauce&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Sauce">Sauce</span>&#xa0;<span class="Japanese">Japanese</span></span></a>
<ul>
<li><a href="#org07496f5">1.2.1. 3 Ingredient Version</a></li>
<li><a href="#orge8f131f">1.2.2. Improved version</a></li>
<li><a href="#org2f966f3">1.2.3. Storing version</a></li>
</ul>
</li>
<li><a href="#orgff58663">1.3. Garlic sauce&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Sauce">Sauce</span></span></a></li>
<li><a href="#orge12c74e">1.4. Cheese dip&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Cheese">Cheese</span>&#xa0;<span class="Dip">Dip</span></span></a></li>
<li><a href="#org82d2550">1.5. Burger Sauce&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Sauce">Sauce</span></span></a></li>
<li><a href="#orgd903ebd">1.6. Creamy Buffalo&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Sauce">Sauce</span></span></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org99035a8" class="outline-2">
<h2 id="org99035a8"><span class="section-number-2">1.</span> Sauces</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgafe3456" class="outline-3">
<h3 id="orgafe3456"><span class="section-number-3">1.1.</span> Salsa&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Mexican">Mexican</span>&#xa0;<span class="Sauce">Sauce</span></span></h3>
<div class="outline-text-3" id="text-1-1">
<p>
Got the recipe from this <a href="https://www.youtube.com/watch?v=Upqp21Dm5vg">video</a>.<br />
</p>

<ul class="org-ul">
<li>2-3 large, ripe tomatoes - firm, fragrant, preferably on the vine<br /></li>
<li>1 medium red onion<br /></li>
<li>1 Jalapeño or a small piece of habanero<br /></li>
<li>Fresh garlic (1 clove)<br /></li>
<li>salt to taste<br /></li>
<li>Freshly ground pepper to taste<br /></li>
<li>Scallions, aka green onions (one)<br /></li>
<li>parsley (optional)<br /></li>
<li>1 red bell pepper (optional)<br /></li>
<li>1 mango (optional) - soft but not mushy to the touch<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org3269357" class="outline-3">
<h3 id="org3269357"><span class="section-number-3">1.2.</span> Teriyaki Sauce&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Sauce">Sauce</span>&#xa0;<span class="Japanese">Japanese</span></span></h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org07496f5" class="outline-4">
<h4 id="org07496f5"><span class="section-number-4">1.2.1.</span> 3 Ingredient Version</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Basic teriyaki sauce<br />
</p>

<p>
Ingredients: <br />
</p>
<ul class="org-ul">
<li>1/3 cup Japanese mirin (sweet rice wine) <br /></li>
<li>2 tablespoons soy sauce, low sodium preferred <br /></li>
<li>1 tablespoon sugar <br /></li>
</ul>

<p>
Instructions:<br />
</p>
<ol class="org-ol">
<li>Combine all the ingredients of the Teriyaki Sauce in a sauce pan. On low heat, simmer and reduce it to a thicker consistency, about 10 minutes.<br /></li>
</ol>

<p>
<a href="https://www.tasteandtellblog.com/teriyaki-chicken/">Another way to make teriyaki sauce</a><br />
<a href="https://www.bbcgoodfood.com/recipes/teriyaki-sauce">Fridge sauce</a><br />
</p>
</div>
</div>

<div id="outline-container-orge8f131f" class="outline-4">
<h4 id="orge8f131f"><span class="section-number-4">1.2.2.</span> Improved version</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Basic teriyaki sauce<br />
</p>

<p>
Ingredients: <br />
</p>
<ul class="org-ul">
<li>1/3 cup Japanese mirin (sweet rice wine) <br /></li>
<li>2 tablespoons soy sauce, low sodium preferred <br /></li>
<li>1 tablespoon sugar <br /></li>
<li>1-2 tablespoons honey<br /></li>
<li>1 cloves garlic<br /></li>
</ul>

<p>
Instructions:<br />
</p>
<ol class="org-ol">
<li>Combine all the ingredients of the Teriyaki Sauce in a sauce pan. On low heat, simmer and reduce it to a thicker consistency, about 10 minutes.<br /></li>
</ol>

<p>
<a href="https://www.tasteandtellblog.com/teriyaki-chicken/">Another way to make teriyaki sauce</a><br />
</p>
</div>
</div>

<div id="outline-container-org2f966f3" class="outline-4">
<h4 id="org2f966f3"><span class="section-number-4">1.2.3.</span> Storing version</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Ingredients: <br />
</p>
<ul class="org-ul">
<li>1-2 tablespoons honey<br /></li>
<li>1 cloves garlic<br /></li>
<li>4cm piece ginger<br /></li>
<li>60 g light brown soft sugar<br /></li>
<li>50ml soy sauce<br /></li>
<li>1 tbsp cornflour<br /></li>
<li>1 tbsp rice wine vinegar<br /></li>
</ul>

<p>
<a href="https://www.bbcgoodfood.com/recipes/teriyaki-sauce">Fridge sauce</a><br />
</p>
</div>
</div>
</div>
<div id="outline-container-orgff58663" class="outline-3">
<h3 id="orgff58663"><span class="section-number-3">1.3.</span> Garlic sauce&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Sauce">Sauce</span></span></h3>
<div class="outline-text-3" id="text-1-3">
<p>
For the love of god don&rsquo;t put any lemon in it<br />
Jesus fucking christ that&rsquo;s awful<br />
<a href="https://fussfreeflavours.com/easy-kebab-shop-garlic-sauce-recipe/">Link</a><br />
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Amount</th>
<th scope="col" class="org-left">Ingredient</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">2 tbsp</td>
<td class="org-left">mayonnaise</td>
</tr>

<tr>
<td class="org-right">2 tbsp</td>
<td class="org-left">yoghurt</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">clove garlic</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">bieslook</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">peterselie</td>
</tr>
</tbody>
</table>

<ol class="org-ol">
<li>With the back of a knife, crush the garlic with a pinch of salt into a paste.<br /></li>
<li>Mix garlic, mayonnaise and yoghurt. Season to taste with salt and pepper.<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orge12c74e" class="outline-3">
<h3 id="orge12c74e"><span class="section-number-3">1.4.</span> Cheese dip&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Cheese">Cheese</span>&#xa0;<span class="Dip">Dip</span></span></h3>
<div class="outline-text-3" id="text-1-4">
<p>
<a href="https://www.youtube.com/watch?v=PTbdvND_YLQ">Sodium Citrate</a><br />
This looks like a better way to make a dip.<br />
</p>
</div>
</div>
<div id="outline-container-org82d2550" class="outline-3">
<h3 id="org82d2550"><span class="section-number-3">1.5.</span> Burger Sauce&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Sauce">Sauce</span></span></h3>
<div class="outline-text-3" id="text-1-5">
<p>
Ingredients:<br />
</p>
<ul class="org-ul">
<li>2/3 Mayonnaise<br /></li>
<li>1/3 Ketchup<br /></li>
<li>Garlic powder<br /></li>
<li>Onion powder<br /></li>
<li>Paprika (regular or smoked)<br /></li>
<li>Sweet relish (chopped pickles)<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgd903ebd" class="outline-3">
<h3 id="orgd903ebd"><span class="section-number-3">1.6.</span> Creamy Buffalo&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Sauce">Sauce</span></span></h3>
<div class="outline-text-3" id="text-1-6">
<p>
<a href="https://www.ethanchlebowski.com/cooking-techniques-recipes/creamy-buffalo-sauce">Link for sauce</a><br />
This is quite a nice sauce I&rsquo;ve tried it with sriracha sauce as hot sauce.<br />
The only thing I noticed is to watch out with what type of sriracha since some of them are thicker.<br />
</p>

<ul class="org-ul">
<li>1 part hot sauce<br /></li>
<li>half part butter<br /></li>
<li>half part yogurt<br /></li>
<li>black pepper<br /></li>
<li>garlic powder<br /></li>
<li>lemon zest<br /></li>

<li>Add the butter to a pan over medium heat. When the butter has started to bubble, remove from heat to let the butter and pan cool, add the hot sauce and stir continuously to form an emulsified sauce between the two.<br /></li>
<li>Once cooled, add the plain yogurt and stir to combine. Follow that with a couple cranks of black pepper, sprinkle of garlic powder, lemon zest, and a pinch of msg. The msg will mellow out the spiciness of the sauce.<br /></li>
<li>Pour into a squeeze bottle and store in the fridge. Use as a dipping sauce, a marinade for chicken, or as a salad dressing. You&rsquo;ve got options, baby.<br /></li>
</ul>


<p>
<a href="https://www.delish.com/cooking/recipe-ideas/recipes/a51133/classic-buffalo-wings-recipe/">With wings</a><br />
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tobin Stultiens</p>
<p class="date">Created: 2022-01-04 di 14:53</p>
</div>
</body>
</html>
